app/Http/Controllers/Admin/BasicSettingController.php

    public function index(): View
    {
        $admin = Auth::user();
        $basic_setting = BasicSetting::where('vendor_id', $admin->vendor_id)->first();
---
select * from "basic_settings" where "vendor_id" = 'M8MdYuHYIAK2A4FxXNT0' and "basic_settings"."deleted_at" is null limit 1